# EqualityTextForAngularDim Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EqualityTextForAngularDim Property
ParameterTypeId Class See Also
---
"Equality Text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EqualityTextForAngularDim { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EqualityTextForAngularDim As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EqualityTextForAngularDim {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace